const maleNames = ['Александр', 'Дмитрий', 'Максим', 'Сергей', 'Андрей', 'Алексей', 'Артем', 'Илья', 'Кирилл', 'Михаил', 'Никита', 'Матвей', 'Роман', 'Егор', 'Арсений', 'Иван', 'Денис', 'Евгений', 'Даниил', 'Тимофей', 'Владислав', 'Игорь', 'Владимир', 'Павел', 'Руслан', 'Марк', 'Константин', 'Тимур', 'Олег', 'Ярослав', 'Антон', 'Николай', 'Глеб', 'Данил', 'Савелий', 'Вадим', 'Степан', 'Богдан', 'Юрий', 'Артур'];
const femaleNames = ['Мария', 'Анна', 'Виктория', 'Алиса', 'Полина', 'Елизавета', 'Екатерина', 'Дарья', 'Вероника', 'Ксения', 'София', 'Александра', 'Анастасия', 'Варвара', 'Ева', 'Арина', 'Кира', 'Маргарита', 'Ульяна', 'Кристина', 'Алёна', 'Таисия', 'Алина', 'Милана', 'Ольга', 'Диана', 'Юлия', 'Татьяна', 'Ирина', 'Елена', 'Наталья', 'Светлана', 'Марина', 'Надежда', 'Любовь', 'Вера', 'Валентина', 'Галина', 'Людмила', 'Нина'];
const lastNamesM = ['Иванов', 'Смирнов', 'Кузнецов', 'Попов', 'Васильев', 'Петров', 'Соколов', 'Михайлов', 'Новиков', 'Федоров', 'Морозов', 'Волков', 'Алексеев', 'Лебедев', 'Семенов', 'Егоров', 'Павлов', 'Козлов', 'Степанов', 'Николаев', 'Орлов', 'Андреев', 'Макаров', 'Никитин', 'Захаров'];
const lastNamesF = ['Иванова', 'Смирнова', 'Кузнецова', 'Попова', 'Васильева', 'Петрова', 'Соколова', 'Михайлова', 'Новикова', 'Федорова', 'Морозова', 'Волкова', 'Алексеева', 'Лебедева', 'Семенова', 'Егорова', 'Павлова', 'Козлова', 'Степанова', 'Николаева', 'Орлова', 'Андреева', 'Макарова', 'Никитина', 'Захарова'];

// Простая функция хеширования строки в число
const getHash = (str: string) => {
    let hash = 0;
    for (let i = 0; i < str.length; i++) {
        hash = str.charCodeAt(i) + ((hash << 5) - hash);
    }
    return Math.abs(hash);
};

export const generateIdentity = (id: string | number) => {
    const seed = getHash(String(id));

    // Определяем пол (четный/нечетный seed)
    const isMale = seed % 2 === 0;

    const names = isMale ? maleNames : femaleNames;
    const surnames = isMale ? lastNamesM : lastNamesF;

    const nameIndex = seed % names.length;
    const surnameIndex = (seed * 13) % surnames.length; // *13 для разнообразия

    return {
        fullName: `${surnames[surnameIndex]} ${names[nameIndex]}`,
        gender: isMale ? 'Мужской' : 'Женский',
        initials: `${names[nameIndex][0]}${surnames[surnameIndex][0]}`
    };
};